In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler
from scipy.stats import pearsonr, spearmanr

# Custom Imports
import wrangle

#### Exercises part 1 using telco

Acquire and prep

### Exercise part 2 using Zillow

In [2]:
df = wrangle.wrangle_zillow()
df.head(5)

,bedroomcnt,bathroomcnt,square_feet,taxvaluedollarcnt,yearbuilt,taxamount,fips_name
0,4,2.0,3633,296425,2005,6941.39,Los Angeles
1,3,4.0,1620,847770,2011,10244.94,Los Angeles
2,3,2.0,2077,646760,1926,7924.68,Los Angeles
6,3,1.0,1244,169471,1950,2532.88,Los Angeles
7,3,2.0,1300,233266,1950,3110.99,Los Angeles

In [3]:
train, validate, test = wrangle.train_validate_test_split(df)

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1169459 entries, 1483210 to 1225832
Data columns (total 7 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   bedroomcnt         1169459 non-null  int64
 1   bathroomcnt        1169459 non-null  float64
 2   square_feet        1169459 non-null  int64
 3   taxvaluedollarcnt  1169459 non-null  int64
 4   yearbuilt          1169459 non-null  int64
 5   taxamount          1169459 non-null  float64
 6   fips_name          1169459 non-null  object
dtypes: float64(2), int64(4), object(1)
memory usage: 71.4+ MB

In [9]:
train_scaled, validate_scaled, test_scaled = wrangle.scale_data(train, validate, test)

In [10]:
train_scaled.head(5)

,bedroomcnt,bathroomcnt,square_feet,taxvaluedollarcnt,yearbuilt,taxamount,fips_name
1483210,0.2,0.272727,0.072759,0.044189,1949,1633.33,Los Angeles
635933,0.4,0.272727,0.074562,0.054043,1964,1711.51,Los Angeles
647772,0.6,0.363636,0.123669,0.378193,1979,8660.46,Orange
1251279,0.2,0.090909,0.011526,0.005963,1920,758.49,Los Angeles
772816,0.4,0.272727,0.040804,0.096488,1972,2528.32,Orange

In [11]:
def wrangle_split_scale():
    
    df = wrangle_zillow()
    train, validate, test = train_validate_test_split(df)
    train_scaled, validated_scaled, test_scaled = scale_data(train, validate, test)
    
    return train_scaled, validate_scaled, test_scaled

### Everything above shows how I created my main function. I combined my wrangle, split and scale functions into one called wrangle_split_scale

In [8]:
train_scaled.head(5)      ## WE will be using scaled data for all of exploration, modeling and testing.

,bedroomcnt,bathroomcnt,square_feet,taxvaluedollarcnt,yearbuilt,taxamount,fips_name
1483210,0.2,0.272727,0.072759,0.044189,1949,1633.33,Los Angeles
635933,0.4,0.272727,0.074562,0.054043,1964,1711.51,Los Angeles
647772,0.6,0.363636,0.123669,0.378193,1979,8660.46,Orange
1251279,0.2,0.090909,0.011526,0.005963,1920,758.49,Los Angeles
772816,0.4,0.272727,0.040804,0.096488,1972,2528.32,Orange

In [12]:
train.head()   ## The original untouched set is for data visuals only

,bedroomcnt,bathroomcnt,square_feet,taxvaluedollarcnt,yearbuilt,taxamount,fips_name
1483210,2,2.0,1733,98022,1949,1633.33,Los Angeles
635933,3,2.0,1766,117631,1964,1711.51,Los Angeles
647772,4,2.5,2665,762659,1979,8660.46,Orange
1251279,2,1.0,612,21957,1920,758.49,Los Angeles
772816,3,2.0,1148,202092,1972,2528.32,Orange